Tekla Open API Reference for Tekla Structures 2025
IntList.IndexOf Method (Int32)
 Gets the index of the specified integer.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int IndexOf(
	int value
)
Public Function IndexOf (
	value As Integer
) As Integer
Parameters
value
Type: System.Int32
The integer to locate in the list.
Return Value
Type: Int32
The index of the integer if found in the list, otherwise -1.
See Also
Reference
IntList Class
IndexOf Overload
Tekla.Structures.Drawing Namespace